import Course from '../component/Course'
import './CoursePage.css'


function CoursePage(){
    const data = [
        {
            type: 'intro',
            img: 'robot1.svg',
            h2: 'منطق ترتیبی',
            p: 'در این درس اول، با تجسم روابط بین چیزها به منظور قرار دادن آنها در ترتیب صحیح، یادگیری قواعد منطق را آغاز خواهید کرد. در پایان این دوره، شما قادر خواهید بود مسائل منطقی پیچیده را به صورت سیستماتیک حل کنید. این دوره مهارت های تفکر انتقادی را که مبنای استدلال ریاضی هستند، می سازد',
            next:{
                type: 'intro',
                h2: '123',
                p:'321',
                next: {
                    type: 'four-answer',
                    img: 'image 9.png',
                    p: 'ما 5 مکعب داریم که جرم همه آنها روی هم 40 کیلوگرم است.',
                    sub: 'حجم یک مکعب را به دست آورید',
                    wrong1 :'چهار کیلوگرم',
                    ans: 'هشت کیلوگرم',
                    wrong2 :'ده کیلوگرم',
                    wrong3 :'بیست کیلوگرم',
                    solution: 'برای حل این سوال ما ابتدا باید خوب به آن دقت کنیم و پس از بررسی کمی درباره آن فکر کنیم. سپس میتوانیم 40 را بر 5 تقسیم کنیم و جواب میشود 8'
                },
            }
        },
        {
            type: 'intro',
            img: 'robot2.gif',
            h2: '',
            p: 'ربات‌های حساس ما افسرده هستند و خواستار تغییر مناظر شده‌اند. روبات‌ها به یک مرکز ارزیابی فرستاده می‌شوند، جایی که اندازه‌گیری می‌شوند و به بخش‌های جدید اختصاص داده می‌شوند.'
        },
        {
            type: 'four-answer',
            img: 'image 9.png',
            p: 'ما 5 مکعب داریم که جرم همه آنها روی هم 40 کیلوگرم است.',
            sub: 'حجم یک مکعب را به دست آورید',
            wrong1 :'چهار کیلوگرم',
            ans: 'هشت کیلوگرم',
            wrong2 :'ده کیلوگرم',
            wrong3 :'بیست کیلوگرم',
            solution: 'برای حل این سوال ما ابتدا باید خوب به آن دقت کنیم و پس از بررسی کمی درباره آن فکر کنیم. سپس میتوانیم 40 را بر 5 تقسیم کنیم و جواب میشود 8'
        },
        {
            type: 'ending',
            img: 'robot3.gif',
            h2: 'مرور و یادآوری',
            p: 'در این درس ما موارد مرتبط با ریاضی پایه و منطق بنیادی را آموختیم و توانستیم چند مثال را به صورت فعال حل کنیم شناخت اطلاعات مفید مهارتی است که در طول این دوره به آن دست خواهید یافت. شناخت اطلاعات مفید مهارتی است که در طول این دوره به آن دست خواهید یافت.'
        },
    ]

    return (
        <div className='coursepage'>
            <Course data={data}/>
        </div>
    )
}

export default CoursePage