import Course from '../component/Course'
import './CoursePage.css'


function CoursePage(){
    const data = [
        {
            type: 'intro',
            key: 1,
            img: 'robot1.svg',
            h2: 'منطق ترتیبی',
            p: 'در این درس اول، با تجسم روابط بین چیزها به منظور قرار دادن آنها در ترتیب صحیح، یادگیری قواعد منطق را آغاز خواهید کرد. در پایان این دوره، شما قادر خواهید بود مسائل منطقی پیچیده را به صورت سیستماتیک حل کنید. این دوره مهارت های تفکر انتقادی را که مبنای استدلال ریاضی هستند، می سازد'
        },
        {
            type: 'intro',
            key: 2,
            img: 'robot2.gif',
            h2: '',
            p: 'ربات‌های حساس ما افسرده هستند و خواستار تغییر مناظر شده‌اند. روبات‌ها به یک مرکز ارزیابی فرستاده می‌شوند، جایی که اندازه‌گیری می‌شوند و به بخش‌های جدید اختصاص داده می‌شوند.'
        },
        {
            type: 'four-answer',
            key: 3,
            img: 'image 9.png',
            p: 'ما 5 مکعب داریم که جرم همه آنها روی هم 40 کیلوگرم است.',
            sub: 'حجم یک مکعب را به دست آورید',
            wrong1 :'چهار کیلوگرم',
            ans: 'هشت کیلوگرم',
            wrong2 :'ده کیلوگرم',
            wrong3 :'بیست کیلوگرم',
        },
        {
            type: 'intro',
            key: 4,
            img: 'robot3.gif',
            h2: 'کارتان عالی بود',
            p: ''
        },
    ]

    return (
        <div className='coursepage'>
            <Course data={data}/>
        </div>
    )
}

export default CoursePage